# Pandas dataframe set index1

In [1]:
import pandas as pd

In [2]:
students = [('Archana',23,'Salem','India'),
           ('Mani',22,'Coimbatore','India'),
            ('Thiru',32,'Los Vegas','US'),
            ('Kalpana',31,'London','UK'),
            ('Sandhiya',21,'Chennai','India')]

In [3]:
data = pd.DataFrame(students)

In [4]:
data

          0   1           2      3
0   Archana  23       Salem  India
1      Mani  22  Coimbatore  India
2     Thiru  32   Los Vegas     US
3   Kalpana  31      London     UK
4  Sandhiya  21     Chennai  India

In [5]:
data = pd.DataFrame(students, columns = ['Name','Age','City','Country'])

In [6]:
data

       Name  Age        City Country
0   Archana   23       Salem   India
1      Mani   22  Coimbatore   India
2     Thiru   32   Los Vegas      US
3   Kalpana   31      London      UK
4  Sandhiya   21     Chennai   India

In [7]:
data = pd.DataFrame(students, columns = ['Name','Age','City','Country'], index = ['s1','s2','s3','s4','s5'])

In [8]:
data

        Name  Age        City Country
s1   Archana   23       Salem   India
s2      Mani   22  Coimbatore   India
s3     Thiru   32   Los Vegas      US
s4   Kalpana   31      London      UK
s5  Sandhiya   21     Chennai   India

# Another method

In [11]:
data = pd.DataFrame(students, columns = ['Name','Age','City','Country'])

In [12]:
data

       Name  Age        City Country
0   Archana   23       Salem   India
1      Mani   22  Coimbatore   India
2     Thiru   32   Los Vegas      US
3   Kalpana   31      London      UK
4  Sandhiya   21     Chennai   India

In [13]:
index = pd.Index(['s1','s2','s3','s4','s5'])

In [14]:
data.set_index(index)

        Name  Age        City Country
s1   Archana   23       Salem   India
s2      Mani   22  Coimbatore   India
s3     Thiru   32   Los Vegas      US
s4   Kalpana   31      London      UK
s5  Sandhiya   21     Chennai   India

In [15]:
data = data.set_index("Name")

In [16]:
data

          Age        City Country
Name
Archana    23       Salem   India
Mani       22  Coimbatore   India
Thiru      32   Los Vegas      US
Kalpana    31      London      UK
Sandhiya   21     Chennai   India

In [17]:
# This will make Name as an index